<center><h1><strong>EDA on Customer Churn Dataset</strong></h1></center>

Import the libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Read the data

In [2]:
df = pd.read_csv("Customer_churn_dataset.csv")

In [4]:
df.head()

,Customer_ID,Age,Gender,Annual_Income,Spending_Score,City,Purchase_Count,Avg_Order_Value,Membership,Churn
0,1001,56.0,Female,762956.0,16,Chennai,11,2854.54,Platinum,0
1,1002,46.0,Male,788873.0,8,Bangalore,9,3231.06,Platinum,0
2,1003,32.0,Male,215953.0,4,Pune,12,11097.03,Silver,0
3,1004,60.0,Male,650328.0,4,Pune,10,2764.38,Gold,1
4,1005,25.0,Female,153267.0,56,Pune,17,3901.14,Gold,0

Total Number of customers

In [7]:
df["Customer_ID"].count()

np.int64(220)

Number of customers by gender

In [12]:
df.groupby("Gender")["Customer_ID"].count()

Gender
Female    102
Male      105
Other      13
Name: Customer_ID, dtype: int64

Average Spending Score of customers

In [14]:
df["Spending_Score"].mean()

np.float64(47.38636363636363)

What is most frequent spending score

In [15]:
df["Spending_Score"].median()

np.float64(47.5)

Average Spending Score by gender

In [16]:
df.groupby("Gender")["Spending_Score"].mean()

Gender
Female    48.029412
Male      46.476190
Other     49.692308
Name: Spending_Score, dtype: float64

Highest 10 Customers by purchase count

In [25]:
df.sort_values(by="Purchase_Count",ascending=False).head(10)[["Customer_ID","Purchase_Count"]]

     Customer_ID  Purchase_Count
158         1159              24
44          1045              22
107         1108              21
48          1049              20
159         1160              20
129         1130              19
163         1164              19
219         1220              19
121         1122              19
155         1156              19

Top 10 customer with highest annual income

In [ ]:
df[["Customer_ID","Annual_Income"]].sort_values(by="Annual_Income",ascending=False).head(10)

     Customer_ID  Annual_Income
128         1129      1192892.0
42          1043      1189458.0
18          1019      1184978.0
101         1102      1177512.0
149         1150      1154208.0

Top 10 customer with highest income and their gender should be female, churn must be True

In [50]:
Female_data = df[(df["Gender"]=="Female") & (df["Churn"]==1)][["Customer_ID","Annual_Income"]]

In [51]:
Female_data.sort_values(by="Annual_Income",ascending=False).head(10)

     Customer_ID  Annual_Income
88          1089      1016651.0
82          1083       940141.0
73          1074       894699.0
155         1156       853286.0
16          1017       841095.0
184         1185       689542.0
197         1198       626467.0
23          1024       550573.0
127         1128       467428.0
188         1189       465826.0